// *** Раздел язык и окружение Language and Environment ***

// Опция "target": "ES2022" - стандарт который будет поддерживаться в проекте.

// Опция "lib": [] - отвечает за набор библиотек и api которые будут включены в работу вашего проекта в массив надо внести все библиотеки которые будут использоваться это по сути ручной набор библиотек для проекта. Например только работа с DOM "lib": ["DOM"].

// Опция "nolib": true - позволяет просто исключить все библиотеки без указания пустого массива в "lib".

// "jsx": "preserve" - настройки препроцессора jsx в реакте.

// Опция "useDefineForClassFields": true - позволяет поля классов формировать через свойство defineProperty в конструкторе.

// *** Раздел Modules ***

// Опция "module": "commonjs" - отвечает за то какую модульную систему мы с вами используем. commonjs чаще всего используется на бэкэнде. es6 чаще всего используется на фронтенде.

// Опция "rootDir": "./" - указывает корневую папку исходных файлов. Обычно это src. По умолчанию указана корневая папка проекта. Например "rootDir": "./src".

// Опция "rootDirs": [] - используется когда необходимо объединить сразу несколько папок чтобы они вели себя как одна корневая. Используется если нам нужно дергать разные файлы из разных папок, проектов.

// Опция "baseUrl": "./" - 



